system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-0.5 0 -0.5)
    (8.5 0 -0.5)
    (8.5 3 -0.5)
    (-0.5 3 -0.5)
    (-0.5 0 3.5)
    (8.5 0 3.5)
    (8.5 3 3.5)
    (-0.5 3 3.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (52 12 16) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    west
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    east
    {
        type wall;
        faces
        (
            (1 5 6 2)
        );
    }
    ground
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    top
    {
        type outlet;
        faces
        (
            (3 2 6 7)
        );
    }
    south
    {
        type symmetryPlane;
        faces
        (
            (0 1 2 3)
        );
    }
    north
    {
        type symmetryPlane;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
