0/nSurfaceLayers
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nSurfaceLayers;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    west
    {
        type            fixedValue;
        value           uniform 0;
    }
    east
    {
        type            fixedValue;
        value           uniform 0;
    }
    ground
    {
        type            fixedValue;
        value           uniform 0;
    }
    top
    {
        type            fixedValue;
        value           uniform 0;
    }
    south
    {
        type            symmetryPlane;
    }
    north
    {
        type            symmetryPlane;
    }
    pipe
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
78069
(
0
0
0
0
0
0
0
0
...
)
;
    }
}


// ************************************************************************* //
