system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // porousBlockage
    {
        action  new;
        type    cellSet;
        name    clampPorousCellSet;
        source  regionToCell;
        file    "clamp_porous.stl";
        sourceInfo
        {
          insidePoints ((5.001 0.01 0.01));
        }
    }
    {
        name    clampPorous;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set clampPorousCellSet;
        }
    }
);

// ************************************************************************* //
